<a href="https://colab.research.google.com/github/amrrahman1/Titanic/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import drive

In [3]:
drive.mount('/content/drive')

Mounted at /content/drive

In [5]:
import pandas as pd

In [6]:
filename = '/content/drive/MyDrive/PTDataScience/titanic.csv'

In [7]:
df = pd.read_csv(filename)

In [8]:
#1- Display the head of the dataframe.
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [77]:
# 2- What is the percentage of people who survived? (hint: find the mean of the survival column).
# Answer is 38.38%

df['Survived'].mean() * 100

38.38383838383838

In [144]:
# 3- How many of each sex survived?
df_survived = df.loc[(df.Survived == 1)]
df_survived[['Survived','Sex']].groupby ('Sex').sum()

        Survived
Sex
female       233
male         109

In [147]:
#4- Considering only the group of passengers who paid less than $10, what percentage of this group survived
# 1st step get the no of servived passengers who paid less than 10 dollars.
df_low_fare = df.loc[(df.Fare < 10)]
df_low_fare[["Fare",'Survived']].groupby("Survived").mean()

              Fare
Survived
0         7.446914
1         7.788064

In [153]:
# 5- Overall, what is the average age of those who didn't survive? 

df_didnt_survive= df.loc[(df.Survived == 0)]
df_didnt_survive['Age'].mean()

30.62617924528302

In [136]:
# 6 Overall, what is the average age of those who did survive?

df_survived_titanic = df.loc[df['Survived'] == 1]
df_survived_titanic['Age'].mean()

28.343689655172415

In [140]:
# 7 What is the average age of those who did and didn't survive grouped by Sex?

# (a)Average age of those who didnt survive:
df_didnt_survive = df.loc[(df.Survived == 0)]
df_didnt_survive[['Survived','Sex','Age']].groupby('Sex').mean()

        Survived        Age
Sex
female         0  25.046875
male           0  31.618056

In [142]:
# (b)Average age of those who survived :
df_survived_= df.loc[(df.Survived == 1)]
df_survived[['Survived','Sex','Age']].groupby('Sex').mean()

        Survived        Age
Sex
female         1  28.847716
male           1  27.276022